<!-- dflook/terraform-github-actions {"workspace":"trixie-2","backend_type":"remote","backend":"2b42aa0e71e46058c2c3972b451a3ee65baaa90cc2d8f8e74ee6ff917a9821c4","plan_job_ref":"Job Test Terraform cloud #373 at https://github.com/dflook/terraform-github-actions/actions/runs/22520633219","plan_hash":"9eb6ebb7a1c9caed2235c6d11e391a5206abc1f2f3ae6b29c92e7f15cebdf42b","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __trixie-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Test Terraform cloud #373](https://github.com/dflook/terraform-github-actions/actions/runs/22520633219)
<details open><summary>Outputs</summary>

```hcl
default        = "default"
from_tfvars    = "from_tfvars"
from_variables = "from_variables"
```
</details>